app/Controllers/News.php

    public function index()
    {
        $modelNews = new ModelNews();
            $data = $modelNews->findAll();
---
SELECT *
FROM `news`

    public function show($id = null)
    {
        $modelNews = new ModelNews();

        $data = $modelNews->orLike('id', $id)
            ->orLike('judul', $id)->get()->getResult();
---
SELECT *
FROM `news`
WHERE `id` LIKE '%1%' ESCAPE '!'
OR  `judul` LIKE '%1%' ESCAPE '!'