app/Controllers/User.php

    public function index()
    {
        $modelUser = new ModelUser();
            $data = $modelUser->findAll();
---
SELECT *
FROM `users`

    public function show($cari = null)
    {
        $modelUser = new ModelUser();

        $data = $modelUser->orLike('id', $cari)
            ->orLike('email', $cari)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `id` LIKE '%email@email.com%' ESCAPE '!'
OR  `email` LIKE '%email@email.com%' ESCAPE '!'