app/Controllers/Vaccination.php

SELECT *
FROM `vaccinations`
---
    public function index()
    {
        $modelVaccination = new ModelVaccination();
            $data = $modelVaccination->findAll();

INSERT INTO `vaccinations` (`program`, `idUser`, `tanggal`, `pelaksana`) VALUES ('Vaksin Dosis 1', '1', '1111-11-11', 'Indihomey')
---
    public function create()
    {
        $modelVaccination = new ModelVaccination();
        $program = $this->request->getPost("program");
        $idUser = $this->request->getPost("idUser");
        $tanggal = $this->request->getPost("tanggal");
        $pelaksana = $this->request->getPost("pelaksana");


        $validation = \Config\Services::validation();

        $valid = $this->validate([
            'program' => 'required',
            'idUser' => 'required',
            'tanggal' => 'required|valid_date',
            'pelaksana' => 'required',


        ]);

        if(!$valid){
            $response = [
                'status' => 404,
                'error' => true,
                'message' => $validation->getErrors(),
            ];

        return $this->respond($response, 404);
        }else {
            $modelVaccination->insert([
                'program' => $program,
                'idUser' => $idUser,
                'tanggal' => $tanggal,
                'pelaksana' => $pelaksana,
            ]);

SELECT *
FROM `vaccinations`
WHERE `vaccinations`.`id` = '3'
DELETE FROM `vaccinations`
WHERE `id` IN ('3')
---
    public function delete($id = null)
    {
        $modelVaccination = new ModelVaccination();

        $cekData = $modelVaccination->find($id);
        if($cekData) {
            $modelVaccination->delete($id);